IDEA StatiCa Open Model
RebarShape.SourceGeometry Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the segments of the rebar shape.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public RebarPolyLine3D SourceGeometry { get; set; }
Public Property SourceGeometry As RebarPolyLine3D
	Get
	Set
public:
property RebarPolyLine3D^ SourceGeometry {
	RebarPolyLine3D^ get ();
	void set (RebarPolyLine3D^ value);
}
Property Value
Type: RebarPolyLine3D
See Also
Reference
RebarShape Class
IdeaRS.OpenModel.Model Namespace